



/* заполнения таблицы Специальности */
INSERT INTO student.specialties (name, `describe`)
VALUES
('ММ',  'Математические методы'),
('ПИ',  'Прикладная информатика'),
('СТ',  'Статистика'),
('МО',  'Менеджмент организаций'),
('БУ',  'Бухгалтерский учет'); 



/* заполнения таблицы Дисциплины */

INSERT INTO student.disciplines (name, `describe`)
VALUES
('Операционные системы', 'Microsoft Windows Vista'),
('Базы данных', 'Microsoft SQL Server'),
('Языки программирования', 'Visual Basic'),
('Информационные технологии', 'Microsoft Office'),
('Проектирование информационных систем', '1C');





/* заполнения таблицы Студенты */

INSERT INTO student.students (
    name, sex, parents, address, phone_number, passport_data, `group`, 
    birthday, date_receipt, is_full_time, number_record_book, nuber_course, id_specialty
)
VALUES
('Иванов А.И.'    , 'Мужской', 'Отец,Мать', 'Москва'   , '+74957895674', '3567-567543', 'ММ11', '1983-12-12', '2007-09-01', True , 13245, 1, 1),
('Петрова И.И.'   , 'Женский', 'Мать'     , 'Москва'   , '+74957889876', '4567-765432', 'ПИ21', '1982-11-01', '2006-08-01', False, 34563, 2, 2),
('Мухин М.А.'     , 'Мужской', 'Отец'     , 'Самара'   , '+78462875690', '5438-098787', 'CT22', '1982-05-14', '2006-07-05', False, 56732, 2, 3),
('Сидорова В.К.'  , 'Женский', 'Нет'      , 'Саратов'  , '+79027868909', '1287-987509', 'МО31', '1981-09-27', '2005-06-23', True , 27543, 3, 4),
('Кожевников А.А.', 'Мужской', 'Мать'     , 'Казань'   , '+79160560476', '2312-675466', 'БУ33', '1901-04-12', '2005-07-21', True , 34217, 3, 5),
('Пальчикова Н.Е.', 'Женский', 'Отец,Мать', 'Челябинск', '+74569098723', '8743-856780', 'ММ12', '1983-09-02', '2007-08-01', False, 43278, 1, 1),
('Царегородцев'   , 'Мужской', 'Отец'     , 'Самара'   , '+78462234769', '6543-834521', 'ПИ41', '1980-02-17', '2004-07-04', True , 43765, 4, 2),
('Баранова Г.В.'  , 'Женский', 'Отец,Мать', 'Чебоксары', '+79027874638', '2133-896567', 'CT42', '1980-07-09', '2004-08-09', False, 10387, 4, 3),
('Леукин П.Г.'    , 'Мужской', 'Нет'      , 'Казань'   , '+79067453678', '2769-634904', 'М051', '1979-02-26', '2003-07-23', True , 67348, 5, 4),
('Николаева А.П.' , 'Женский', 'Мать'     , 'Саратов'  , '+78546456432', '3256-490932', 'БУ53', '1979-03-17', '2003-06-21', False, 45287, 5, 5);
            


/* заполнения таблицы Экзамены */
INSERT INTO student.exams
VALUES
(1, 1,  '2008-02-01', 5),
(1, 4,  '2008-02-09', 3),
(1, 2,  '2008-02-14', 4),
(2, 5,  '2008-01-30', 4),
(2, 3,  '2008-02-23', 5),
(2, 1,  '2008-02-27', 5),
(3, 3,  '2008-01-26', 3),
(3, 1,  '2008-02-05', 3),
(3, 5,  '2008-02-15', 3),
(3, 2,  '2008-02-20', 3),
(4, 2,  '2008-12-26', 3),
(4, 4,  '2009-01-21', 4),
(4, 3,  '2009-01-05', 4),
(4, 5,  '2009-01-16', 5),
(5, 4,  '2008-01-12', 4),
(5, 5,  '2008-01-18', 4),
(5, 1,  '2008-01-25', 4),
(6, 2,  '2009-12-17', 4),
(6, 4,  '2009-12-26', 5),
(6, 1,  '2010-01-05', 4);



