% Параметры регулятора
b1 = 4.5;b2 = 2.1;a1 = 1.7;
W1 = tf([b2 b1], [1 0]); % ПИ-регулятор
W2 = tf([b1 b2*a1], [a1 1]); % ПД-регулятор
W3 = tf([b2 b1 b2*a1], [0.1*a1 1 0]); % ПИД-регулятор
subplot(321); step(W1, 10);title('ПИ-регулятора');
subplot(323); step(W2, 10);title('ПД-регулятора');
subplot(325); step(W3, 30);title('ПИД-регулятора');
subplot(322); impulse(W1, 10);title('ПИ-регулятора');
subplot(324); impulse(W2, 10);title('ПД-регулятора');
subplot(326); impulse(W3, 10);title('ПИД-регулятора');
